---
kind: property
id: P:Autodesk.Revit.DB.OrdinateDimensionSetting.OriginVisibility
source: html/abba12a6-29a8-bdfe-164f-308bbb2129dd.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.OriginVisibility Property

Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string).

## Syntax (C#)
```csharp
public OrdinateOriginVisibility OriginVisibility { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration